performance-report/statistics.json
{
  "Blockchain Status" : {
    "transaction" : "Blockchain Status",
    "sampleCount" : 150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 41.66666666666664,
    "medianResTime" : 25.0,
    "minResTime" : 6.0,
    "maxResTime" : 252.0,
    "pct1ResTime" : 99.0,
    "pct2ResTime" : 134.14999999999992,
    "pct3ResTime" : 230.0700000000004,
    "throughput" : 40.92769440654843,
    "receivedKBytesPerSec" : 64.46911238062756,
    "sentKBytesPerSec" : 5.475677864938608
  },
  "Health Check" : {
    "transaction" : "Health Check",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 39.59500000000001,
    "medianResTime" : 29.0,
    "minResTime" : 3.0,
    "maxResTime" : 170.0,
    "pct1ResTime" : 77.0,
    "pct2ResTime" : 99.0,
    "pct3ResTime" : 143.99,
    "throughput" : 66.20324395895399,
    "receivedKBytesPerSec" : 70.60278570837471,
    "sentKBytesPerSec" : 8.146102284011917
  },
  "Poll Status" : {
    "transaction" : "Poll Status",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 40.91500000000002,
    "medianResTime" : 32.0,
    "minResTime" : 3.0,
    "maxResTime" : 147.0,
    "pct1ResTime" : 81.0,
    "pct2ResTime" : 100.94999999999999,
    "pct3ResTime" : 142.99,
    "throughput" : 70.47216349541931,
    "receivedKBytesPerSec" : 60.69965644820296,
    "sentKBytesPerSec" : 9.0154818534179
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1000,
    "errorCount" : 250,
    "errorPct" : 25.0,
    "meanResTime" : 38.445,
    "medianResTime" : 27.0,
    "minResTime" : 1.0,
    "maxResTime" : 588.0,
    "pct1ResTime" : 78.0,
    "pct2ResTime" : 111.0,
    "pct3ResTime" : 272.7900000000002,
    "throughput" : 198.5308715505261,
    "receivedKBytesPerSec" : 236.1935738038515,
    "sentKBytesPerSec" : 37.97484551816557
  },
  "Submit Vote" : {
    "transaction" : "Submit Vote",
    "sampleCount" : 250,
    "errorCount" : 250,
    "errorPct" : 100.0,
    "meanResTime" : 5.512000000000001,
    "medianResTime" : 4.0,
    "minResTime" : 1.0,
    "maxResTime" : 98.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 13.449999999999989,
    "pct3ResTime" : 23.0,
    "throughput" : 57.116746630111955,
    "receivedKBytesPerSec" : 42.502891535298154,
    "sentKBytesPerSec" : 21.66866575279872
  },
  "Get Results" : {
    "transaction" : "Get Results",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 73.57499999999997,
    "medianResTime" : 47.0,
    "minResTime" : 18.0,
    "maxResTime" : 588.0,
    "pct1ResTime" : 136.0,
    "pct2ResTime" : 271.09999999999957,
    "pct3ResTime" : 536.2200000000007,
    "throughput" : 39.706174310105226,
    "receivedKBytesPerSec" : 75.80622146118722,
    "sentKBytesPerSec" : 5.195925153861426
  }
}